{
    "TITLE": "Answers for Questions",
    "DATE": "12/23/26",
    "CONTENT": "<p>Hey everyone! It’s been a while since we’ve posted - sorry about that. Shortly after we\nannounced we’d be ceasing the scheduled updates we started to receive a lot more\nquestions than usual, so tonight we’ll be answering some of them, and sneaking in some relevant images. </p><br><p>Without further ado, here’s our answers!</p><br><p><b>Q: The maps look pretty big. Will we be able to run?</b>\nA: Yes! You hold down the cancel button for a moment, and then release to dash. It works just like it does in Mother 3.\n</p><center><figure><a href=\"http://i.imgur.com/0iheOxR.gif\" target=\"_blank\"><img src=\"http://i.imgur.com/0iheOxR.gif\" alt=\"image\"></a><figcaption>And just like in Mother 3, getting sick or hurt prevents you from running.</figcaption></figure></center><br><p><b>Q: Are any new PSI abilities being added?</b></p><p>A: Yes! Though we aren’t quite ready to show off all the new stuff, we can say that a lot of our focus on new abilities is aimed towards support abilities and the countering of support abilities - and this goes for enemies as well. However, even returning PSI powers will be getting attention and additional effects.</p><center><figure><a href=\"http://i.imgur.com/YxYPLdB.gif\" target=\"_blank\"><img src=\"http://i.imgur.com/YxYPLdB.gif\" alt=\"image\"></a><figcaption></figcaption></figure></center><br><p><b>Q: What kinds of things are returning? Is (particular enemy, song, character) returning?</b></p><p>A: If it’s been in every official Mother game, it’s a safe bet to assume we’re including\nit. Things like flowers, sidewalks, gangsters, rats, Pollyana, birds, dogs, boys, girls,\netc etc. However, previous characters are not returning. This is in our FAQ - No Ness, no\nPorky, no Giygas, no Lucas, not even Ninten. Mr. Saturn is a returning element, but as\nthere is no one Mr. Saturn character, this doesn’t really count. Gangsters though,\ngangsters are coming back.</p><center><figure><a href=\"http://i.imgur.com/M547rd7.gif\" target=\"_blank\"><img src=\"http://i.imgur.com/M547rd7.gif\" alt=\"image\"></a><figcaption></figcaption></figure></center><br><b>Q: What hardware is compatible with Mother 4?</b><p>A: The game will run on <b>Windows, macOS, and Linux</b> desktop and laptop computers. We can’t guarantee support on any other platform. It’s compatible with most computer gamepads - be they USB or otherwise.</p><br><p><b>Q: A lot of Nintendo fan games have been taken down recently. Has Nintendo\ncontacted you or taken any action against you yet? What will you do if they do?</b></p><p>A: So far we haven’t heard anything! If we do, we’ll do everything in our power to make sure you guys get a game even if we have to release under a different name after removing any copyrighted material and systems.  Our goal is to respect and pay tribute to the Mother series, not fight the people who made it.</p><br><b>Q: Why are you still calling the game Mother 4? Why not Step Mother or Mother Gaiden, or an original title?</b><p>A: This is a pretty common question - especially lately with the above concern taken into account, and we absolutely understand why. The Mother series is precious to a lot of people, and that includes us. We’re not out to fill in any blanks or any any calls to action or assume any duties because this will never be <i>the</i> Mother 4. That was never the intention. </p><p>When Mother 3 first released, a lot of people played through the game without even knowing Japanese, instead relying on the expressive characters and setting to tell the story. Even before they read the story in English, people were wondering what would - or even could - come next. In this way Mother games seem particularly strong… People don’t just play them, through fan art, comics, costumes, ideas, theories, communities, even games, they seem to play <i>with</i> Mother games. </p><p>We’re doing the same thing, because all of us are still in love with the world and characters we grew up playing with. We still wonder what could come next (relatively speaking), and our version of Mother 4 presents just one possibility, expressed through us playing with the setting that has been laid out ahead of time.</p> \n<p>Ultimately, just making this game has been its own reward, even if it winds up being another dead leaf in the playground of the Mother universe.</p> \n<br><p>Of course if people wind up liking our answer, that’s just fine too.</p><b>Q: You guys are taking too long!</b><p>A: That’s why we appreciate your patience so much. We’re hobbyists and amateurs, but we try our best even if it doesn’t always go the best. For example, this post is about a week late - and we can’t say anything much other than we’re glad you’re still here to read it. </p><br><b>Q: So what about updates?</b><p>A: While we’re always working on the game, we definitely understand the anxiousness when we go quiet or miss a deadline. We’re still trying new things, and will continue to on this front. </p><br><p>We’ll get it sooner rather than later - and in the meantime we absolutely appreciate your patience here, too. You’re really great to us!</p><br><center><figure><a href=\"http://i.imgur.com/FkBYiCw.png\" target=\"_blank\"><img src=\"http://i.imgur.com/FkBYiCw.png\" alt=\"image\"></a><figcaption>We really appreciate it!</figcaption></figure></center><br><p>Really, thank you, from the bottom of all of our hearts.</p><br><p>We’ll see you next update! We’ll be going into a little more detail on one of those first three questions then.</p>",
    "PREVIEW": "Hey everyone! It’s been a while since we’ve posted - sorry about that. Shortly after we\nannounced we’d be ceasing the scheduled updates we started to receive a lot more\nquestions than usual, so tonight we’ll be answering some of them, and sneaking in some relevant images. ",
    "ID": 3
}
